Revit 2026 API

# WorksetTableGetWorkset(Guid) Method

---

Returns the workset from a input Guid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Workset GetWorkset(
	Guid guid
)
```
```vb
Public Function GetWorkset (
	guid As Guid
) As Workset
```
```cpp
public:
Workset^ GetWorkset(
	Guid guid
)
```
```fsharp
member GetWorkset :
        guid : Guid -> Workset
```

#### Parameters

guid Guid
     Guid of the workset.

#### Return Value

Workset The returned workset.  if there is no workset in this table with this Id.

#### Reference

WorksetTable Class

GetWorkset Overload

Autodesk.Revit.DB Namespace